config/doom/doom-emacs.org
* packages.el - package management (custom)
#+begin_src elisp :header-args :tangle packages.el :comments yes
;; -*- no-byte-compile: t; -*-
;;; $DOOMDIR/packages.el

;; To install a package with Doom you must declare them here and run 'doom sync'
;; on the command line, then restart Emacs for the changes to take effect -- or
;; use 'M-x doom/reload'.


;; To install SOME-PACKAGE from MELPA, ELPA or emacsmirror:
;; (package! some-package)
(unpin! org-roam)
(package! org-roam-ui)
;; To install a package directly from a remote git repo, you must specify a
;; `:recipe'. You'll find documentation on what `:recipe' accepts here:
;; https://github.com/radian-software/straight.el#the-recipe-format
;; (package! another-package
;;   :recipe (:host github :repo "username/repo"))

(package! gnuplot)

(package! cider)

(package! csv-mode)

(package! deadgrep)

(package! org-habit-stats)

(package! ebuku)

(package! fish-mode)

(package! org-ql)

(package! org-roam-ql)

(package! exec-path-from-shell) ;; Makes sure to use system shell. Nix had locked me into bash once.

(package! typst-ts-mode
  :recipe (:host codeberg :repo "meow_king/typst-ts-mode"))

(package! org-contacts)

(package! nov)

(package! ox-epub)

(package! empv)

(package! org-super-agenda)

(package! org-modern)

(package! olivetti)

(package! all-the-icons)

(package! org-web-tools)

(package! eat
  :recipe (:host codeberg :repo "akib/emacs-eat"))

(package! jinx)

(package! alert
  :recipe (:host github :repo "jwiegley/alert"))

(package! everforest
  :recipe (:repo "https://github.com/Theory-Of-Everything/everforest-emacs.git"))

(package! anki-editor
  :recipe (:host github :repo "anki-editor/anki-editor"))

(package! flexoki-themes)

(package! transient-showcase
  :recipe (:host github :repo "positron-solutions/transient-showcase"))

(package! sudo-edit)

(package! alarm-clock)

(package! mpdel)

(package! wttrin)

(package! ox-typst
  :recipe (:host github :repo "jmpunkt/ox-typst"))

(package! janet-ts-mode
  :recipe (:host github :repo "sogaiu/janet-ts-mode"))

(package! yeetube)

(package! fretboard
  :recipe (:type git :host github :repo "skyefreeman/fretboard.el" :branch "main" :files ("*.el")))

(package! just-mode)

(package! justl)

(package! listen)

;; Quarto editing
(package! polymode)
(package! poly-markdown)
(package! quarto-mode
  :recipe (:type git :host github :repo "quarto-dev/quarto-emacs" :branch "main" :files ("*.el")))

;; Multicursor
(package! multiple-cursors)

(package! org-sliced-images)
;; If the package you are trying to install does not contain a PACKAGENAME.el
;; file, or is located in a subdirectory of the repo, you'll need to specify
;; `:files' in the `:recipe':
;; (package! this-package
;;   :recipe (:host github :repo "username/repo"
;;            :files ("some-file.el" "src/lisp/*.el")))

;; If you'd like to disable a package included with Doom, you can do so here
;; with the `:disable' property:
;; (package! builtin-package :disable t)

;; You can override the recipe of a built in package without having to specify
;; all the properties for `:recipe'. These will inherit the rest of its recipe
;; from Doom or MELPA/ELPA/Emacsmirror:
;; (package! builtin-package :recipe (:nonrecursive t))
;; (package! builtin-package-2 :recipe (:repo "myfork/package"))

;; Specify a `:branch' to install a package from a particular branch or tag.
;; This is required for some packages whose default branch isn't 'master' (which
;; our package manager can't deal with; see radian-software/straight.el#279)
;; (package! builtin-package :recipe (:branch "develop"))

;; Use `:pin' to specify a particular commit to install.
;; (package! builtin-package :pin "1a2b3c4d5e")


;; Doom's packages are pinned to a specific commit and updated from release to
;; release. The `unpin!' macro allows you to unpin single packages...
;; (unpin! pinned-package)
;; ...or multiple packages
;; (unpin! pinned-package another-pinned-package)
;; ...Or *all* packages (NOT RECOMMENDED; will likely break things)
;; (unpin! t)
#+end_src
* config.el - general configuration
** Intro
#+begin_src elisp :header-args :tangle config.el :comments yes
;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-

;; Place your private configuration here! Remember, you do not need to run 'doom
;; sync' after modifying this file!


;; Some functionality uses this to identify you, e.g. GPG configuration, email
;; clients, file templates and snippets. It is optional.
;; (setq user-full-name "John Doe"
;;       user-mail-address "john@doe.com")

;; Doom exposes five (optional) variables for controlling fonts in Doom:
;;
;; - `doom-font' -- the primary font to use
;; - `doom-variable-pitch-font' -- a non-monospace font (where applicable)
;; - `doom-big-font' -- used for `doom-big-font-mode'; use this for
;;   presentations or streaming.
;; - `doom-symbol-font' -- for symbols
;; - `doom-serif-font' -- for the `fixed-pitch-serif' face
;;
;; See 'C-h v doom-font' for documentation and more examples of what they
;; accept. For example:
;;
;;(setq doom-font (font-spec :family "Fira Code" :size 12 :weight 'semi-light)
;;      doom-variable-pitch-font (font-spec :family "Fira Sans" :size 13))
;;
#+end_src
** Font
#+begin_src elisp :header-args :tangle config.el :comments yes
(setq doom-font (font-spec :family "JetBrainsMono Nerd Font Mono" :size 16)
      doom-variable-pitch-font (font-spec :family "Fira Sans" :size 16)
      doom-big-font (font-spec :family "JetBrainsMono Nerd Font Mono" :size 26))
(after! doom-theme
  (setq doom-themes-enable-bold t
        doom-themes-enable-italic t))
(custom-set-faces!
  '(font-lock-comment-face :slant italic)
  '(font-lock-keyword-face :slant italic))

;; If you or Emacs can't find your font, use 'M-x describe-font' to look them
;; up, `M-x eval-region' to execute elisp code, and 'M-x doom/reload-font' to
;; refresh your font settings. If Emacs still can't find your font, it likely
;; wasn't installed correctly. Font issues are rarely Doom issues!

#+end_src
** Theme
#+begin_src elisp :header-args :tangle config.el :comments yes
;; There are two ways to load a theme. Both assume the theme is installed and
;; available. You can either set `doom-theme' or manually load a theme with the
;; `load-theme' function. This is the default:

(setq doom-theme 'everforest-hard-dark)
#+end_src
** Line number
#+begin_src elisp :header-args :tangle config.el :comments yes
;; This determines the style of line numbers in effect. If set to `nil', line
;; numbers are disabled. For relative line numbers, set this to `relative'.
(setq display-line-numbers-type 'visual)
#+end_src
** Splash screen
#+begin_src elisp :header-args :tangle config.el :comments yes
(setq fancy-splash-image "/home/lucas/.config/doom/assets/emacs_logo.svg")
(setq +doom-dashboard-menu-sections nil)
(defun doom-dashboard-widget-shortmenu ())
(defun doom-dashboard-widget-footer ())
(defun doom-dashboard-widget-loaded ()
  (when doom-init-time
    (insert
     ""
     (propertize
      (+doom-dashboard--center
       +doom-dashboard--width
       "Liberty, Vitality, Beauty")
      'face 'doom-dashboard-loaded)
     "\n")))
#+end_src
** Org-mode
*** Basic setup
#+begin_src elisp :header-args :tangle config.el :comments yes
;; If you use `org' and don't want your org files in the default location below,
;; change `org-directory'. It must be set before org loads!
(setq org-directory "~/org/")
(setq org-scheduled-past-days 0)
(add-to-list 'org-emphasis-alist
             '("*" (bold :foreground "orange")))
#+end_src
