config/doom/doom-emacs.org
*** Roam
#+begin_src elisp :header-args :tangle config.el :comments yes
(setq org-roam-directory (file-truename "~/org/roam/"))
(org-roam-db-autosync-mode)
(use-package! websocket
  :after org-roam)
(use-package! org-roam-ui
  :hook (after-init . org-roam-ui-mode)
  :config
  (setq org-roam-ui-sync-theme t
        org-roam-ui-follow t
        org-roam-ui-update-on-save t
        org-roam-ui-open-on-start t))
(setq org-roam-capture-templates
      '(("d" "default" plain "%?"
         :target (file+head "%<%Y%m%d%H%M%S>-${slug}.org"
                            "#+title: ${title}\n")
         :unnarrowed t)))
(defun my-org-roam-extract-subtree-format ()
  "Ensure the extracted file has properties above the title and a clean title."
  (when (derived-mode-p 'org-mode)
    (goto-char (point-min))
    ;; Adjust the file title
    (when (re-search-forward "^#\\+title:.*" nil t)
      (replace-match (concat "#+title: " (org-get-heading t t t t))))
    ;; Move properties block to the top of the file
    (when (re-search-forward "^:PROPERTIES:" nil t)
      (let ((props (buffer-substring-no-properties
                    (match-beginning 0)
                    (progn (re-search-forward "^:END:" nil t) (point)))))
        (delete-region (match-beginning 0) (point))
        (goto-char (point-min))
        (insert props "\n")))))

(advice-add 'org-roam-extract-subtree :after #'my-org-roam-extract-subtree-format)
#+end_src
*** Agenda
**** Define a global keymap for the agenda command
#+begin_src elisp :header-args :tangle config.el :comments yes
(setq org-agenda-files '("~/org/agenda/todo.org" "~/org/agenda/calendar.org" "~/org/agenda/uni-calendar.org"))
(define-key global-map (kbd "C-c a") 'org-agenda)
#+end_src
**** Create all the necessary keywords
#+begin_src elisp :header-args :tangle config.el :comments yes
(setq org-todo-keywords
      '((sequence "TODO(t)" "NEXT(n)" "PROJ(p)" "HOLD(h)" "EVNT(e)" "|" "DONE(d)" "PAST(s)")))
#+end_src
**** Log creation, activation, and done time
#+begin_src elisp :header-args :tangle config.el :comments yes
(defun log-todo-next-creation-date (&rest ignore)
  "Log NEXT creation time in the property drawer under the key 'ACTIVATED'"
  (when (and (string= (org-get-todo-state) "NEXT")
             (not (org-entry-get nil "ACTIVATED")))
    (org-entry-put nil "ACTIVATED" (format-time-string "[%Y-%m-%d]"))))
(add-hook 'org-after-todo-state-change-hook #'log-todo-next-creation-date)
(setq org-log-done 'time)
#+end_src
**** Custom agenda views
#+begin_src elisp :header-args :tangle config.el :comments yes
(setq org-agenda-custom-commands
      '(("n" "NEXT items"
	 ((todo "NEXT")))
	("g" "General agenda"
	 ((agenda ""
		  ((org-agenda-start-day "+0d")
                   (org-agenda-deadline-leaders
                    '("" "" "%2d d. ago: "))
                   (org-agenda-start-on-weekday 0)
                   (org-agenda-span 'week)
		   (org-deadline-warning-days 0)))))
	("d" "Diffuse time"
	 ((tags "%diffuse")))
        ("r" "Random Review"
         ((tags-todo "CATEGORY=\"quest\"+TODO=\"TODO\"-SCHEDULED={.+}-DEADLINE={.+}"
                     ((org-agenda-overriding-header "Quests")
                      (org-agenda-max-entries 5)))
          (tags-todo "CATEGORY=\"spiritual\"+TODO=\"TODO\"-SCHEDULED={.+}-DEADLINE={.+}"
                     ((org-agenda-overriding-header "Spiritual")
                      (org-agenda-max-entries 5)))
          (tags-todo "CATEGORY=\"social\"+TODO=\"TODO\"-SCHEDULED={.+}-DEADLINE={.+}"
                     ((org-agenda-overriding-header "Social")
                      (org-agenda-max-entries 5)))
          (tags-todo "CATEGORY=\"physical\"+TODO=\"TODO\"-SCHEDULED={.+}-DEADLINE={.+}"
                     ((org-agenda-overriding-header "Physical")
                      (org-agenda-max-entries 5)))
          (tags-todo "CATEGORY=\"studies\"+TODO=\"TODO\"-SCHEDULED={.+}-DEADLINE={.+}"
                     ((org-agenda-overriding-header "Studies")
                      (org-agenda-max-entries 5)))
          (tags-todo "CATEGORY=\"organization\"+TODO=\"TODO\"-SCHEDULED={.+}-DEADLINE={.+}"
                     ((org-agenda-overriding-header "Organization")
                      (org-agenda-max-entries 5)))
          (tags-todo "CATEGORY=\"diffuse\"+TODO=\"TODO\"-SCHEDULED={.+}-DEADLINE={.+}"
                     ((org-agenda-overriding-header "Diffuse")
                      (org-agenda-max-entries 5)))
          (tags-todo "CATEGORY=\"aesthetical\"+TODO=\"TODO\"-SCHEDULED={.+}-DEADLINE={.+}"
                     ((org-agenda-overriding-header "Aesthetical")
                      (org-agenda-max-entries 5)))
          (tags-todo "CATEGORY=\"financial\"+TODO=\"TODO\"-SCHEDULED={.+}-DEADLINE={.+}"
                     ((org-agenda-overriding-header "Financial")
                      (org-agenda-max-entries 5)))
          (tags-todo "CATEGORY=\"technological\"+TODO=\"TODO\"-SCHEDULED={.+}-DEADLINE={.+}"
                     ((org-agenda-overriding-header "Technological")
                      (org-agenda-max-entries 5)))
          )
         )
        ))
(setq org-agenda-tags-column 0)
#+end_src
**** Beautify with icons
#+begin_src elisp :header-args :tangle config.el :comments yes
(defun gk-nerd-agenda-icons (fun prefix alist)
  "Makes an org agenda alist"
  (mapcar (pcase-lambda (`(,category . ,icon))
            `(,category
              (,(funcall fun (concat prefix icon) :height 1.0))))
          alist))

(setq org-agenda-category-icon-alist
      (append
       (gk-nerd-agenda-icons #'nerd-icons-faicon "nf-fa-"
			     '(("inbox" . "inbox")
			       ("uni-calendar" . "university")
			       ("calendar" . "calendar")
			       ("quest" . "person_hiking")
                               ("spiritual" . "cross")
                               ("social" . "group")
                               ("physical" . "dumbbell")
                               ("studies" . "book_open")
                               ("organization" . "compass_drafting")
                               ("aesthetical" . "music")
                               ("financial" . "money")
                               ("technological" . "laptop")
                               ))
       '(("" '(space . (:width (11)))))))
#+end_src
**** Beautify prefix format
#+begin_src elisp :header-args :tangle config.el :comments yes
(setq org-agenda-prefix-format '((agenda . " %-2i %?-12t %s ")
                                 (todo .   " %-2i ")
                                 (tags .   " %-2i ")
                                 (search . " %-2i ")))
#+end_src
