config/doom/config.el

;; [[file:doom-emacs.org::*Capture templates][Capture templates:1]]
(setq org-capture-templates
      `(("i" "Task Inbox" entry (file+headline "~/org/agenda/todo.org" "Inbox")
         ,(concat "* TODO %? \n"
                  "/Entered on/ %U"))
        ("@" "Task Inbox [mu4e]" entry (file+headline "~/org/agenda/todo.org" "Inbox")
         ,(concat "* TODO Process \"%a\" %?\n"
                  "/Entered on/ %U"))
        ("e" "Event Inbox" entry (file+headline "~/org/agenda/calendar.org" "Once")
         ,(concat "* EVNT %? \n"
                  "/Entered on/ %U"))
        ("a" "Anki Russian Card" entry (file+headline "~/org/roam/20250730210718-r_a_russian_a1_vocabulary.org" "A1 vocab")
         ,(concat "** %(progn (setq my-capture-text (read-string \"Russian word: \")) my-capture-text)\n"
                  ":PROPERTIES:\n"
                  ":ANKI_NOTE_TYPE: lang\n"
                  ":END:\n"
                  "*** Front\n"
                  "%(bound-and-true-p my-capture-text)\n"
                  "*** Sentence\n"
                  "\"%^{example sentence}\"\n"
                  "*** Back\n"
                  "%^{translation}\n\n"
                  "\(%^{translation class}\)\n\n"
                  "\"%^{translation sentence}\"\n"))))
(define-key global-map (kbd "C-c c") 'org-capture)
;; Capture templates:1 ends here

;; [[file:doom-emacs.org::*Org link parameters][Org link parameters:1]]
(org-link-set-parameters
 "yt"
 :follow (lambda (path)
           (async-shell-command (format "mpv %s" path)))
 "ytl"
 :follow (lambda (path)
           (async-shell-command (format "mpv --ytdl-format=worst %s" path)))
 "qute"
 :follow (lambda (path)
           (async-shell-command (format "qutebrowser %s" path)))
 "copy"
 :follow (lambda (path)
           (async-shell-command (format "echo \"%s\" \| xclip -selection clipboard" path))))
;; Org link parameters:1 ends here
