config/doom/config.el

;; [[file:doom-emacs.org::*Rest][Rest:1]]
(setq org-modern-fold-stars
      '(("▶" . "▼")
        ("▷" . "▽")
        ;; ("⯈" . "⯆")
        ("▷" . "▽")
        ("▹" . "▿")
        ("▸" . "▾"))
      )



;; Org timer and alarm
(setq org-clock-sound "~/Downloads/ding-36029.wav")

(defun jl-notify-send (message)
  "Send notification with notify-send."
  (start-process "notify" nil "notify-send" "Emacs" message))

(setq org-show-notification-handler 'jl-notify-send)

(setq alarm-clock-sound-file "~/Downloads/alarm_MP3WRAP.mp3")

;; Tangle
(setq org-babel-tangle-use-relative-file-links t)

;; PDF
(setq +latex-viewers '(pdf-tools))

;; TeX
(after! tex
  (add-to-list 'TeX-command-list
               '("LaTeX with shell escape"
                 "pdflatex -shell-escape %s"
                 TeX-run-command t t :help "Run pdflatex with -shell-escape")))

(add-to-list 'load-path "/home/lucas/.config/emacs/.local/straight/repos/fretboard.el/")

(require 'fretboard)
(after! fretboard
  ;; First ensure the keymap exists
  (defvar fretboard-mode-map (make-sparse-keymap))

  ;; Then use map! to bind keys to that specific keymap
  (map! :map fretboard-mode-map
        :n "n" #'fretboard-next
        :n "p" #'fretboard-previous
        :n "k" #'fretboard-next-type
        :n "j" #'fretboard-previous-type
        :n "," #'fretboard-next-mode
        :n "m" #'fretboard-previous-mode
        :n "d" #'fretboard-toggle-display-type
        :n "t" #'fretboard-toggle-tuning-type
        :n "r" #'fretboard-toggle-relative-notes
        :n "s" #'fretboard-switch-to-scale
        :n "c" #'fretboard-switch-to-chord
        :n "q" #'fretboard-quit-all))
;; Email
;; https://macowners.club/posts/email-emacs-mu4e-macos/
;; (add-to-list 'load-path "/usr/share/emacs/site-lisp/mu4e/")
;; (use-package! mu4e
;;   :ensure nil
;;   :config
;;   (setq mu4e-change-filenames-when-moving t)

;;   (setq mu4e-update-interval (* 10 60))
;;   (setq mu4e-get-mail-command "mbsync -a")
;;   (setq mu4e-maildir "~/.local/share/mail")
;;   (setq mu4e-contexts
;;         (list
;;          ;; Work account
;;          (make-mu4e-context
;;           :name "University"
;;           :match-func
;;           (lambda (msg)
;;             (when msg
;;               (string-prefix-p "/jlng3@alu.ua.es" (mu4e-message-field msg :maildir))))
;;           :vars '((user-mail-address . "jlng3@alu.ua.es")
;;                   (user-full-name    . "Lucas Galdino")
;;                   (mu4e-drafts-folder  . "/jlng3@alu.ua.es/Drafts")
;;                   (mu4e-sent-folder  . "/jlng3@alu.ua.es/Sent")
;;                   (mu4e-trash-folder  . "/jlng3@alu.ua.es/Trash")))
;;          (make-mu4e-context
;;           :name "Gmail"
;;           :match-func
;;           (lambda (msg)
;;             (when msg
;;               (string-prefix-p "/jucasngaldino@gmail.com" (mu4e-message-field msg :maildir))))
;;           :vars '((user-mail-address . "jlucasngaldino@gmail.com")
;;                   (user-full-name    . "Lucas Galdino")
;;                   (mu4e-drafts-folder  . "/jlucasngaldino@gmail.com/[Gmail]/Drafts")
;;                   (mu4e-refile-folder . "/jlucasngaldino@gmail.com/[Gmail/All Mail]")
;;                   (mu4e-sent-folder  . "/jlucasngaldino@gmail.com/[Gmail]/Sent Mail")
;;                   (mu4e-trash-folder  . "/jlucasngaldino@gmail.com/[Gmail]/Trash")))
;;          (make-mu4e-context
;;           :name "Personal"
;;           :match-func
;;           (lambda (msg)
;;             (when msg
;;               (string-prefix-p "/lucasgaldino@disroot.org" (mu4e-message-field msg :maildir))))
;;           :vars '((user-mail-address . "lucasgaldino@disroot.org")
;;                   (user-full-name    . "Lucas Galdino")
;;                   (mu4e-drafts-folder  . "/lucasgaldino@disroot.org/Drafts")
;;                   (mu4e-sent-folder  . "/lucasgaldino@disroot.org/Sent")
;;                   (mu4e-trash-folder  . "/lucasgaldino@disroot.org/Trash")))
;;          (make-mu4e-context
;;           :name "Business"
;;           :match-func
;;           (lambda (msg)
;;             (when msg
;;               (string-prefix-p "/lucas@lucasgaldino.com" (mu4e-message-field msg :maildir))))
;;           :vars '((user-mail-address . "lucas@lucasgaldino.com")
;;                   (user-full-name    . "Lucas Galdino")
;;                   (mu4e-drafts-folder  . "/lucas@lucasgaldino.com/Drafts")
;;                   (mu4e-sent-folder  . "/lucas@lucasgaldino.com/Sent")
;;                   (mu4e-refile-folder . "/lucas@lucasgaldino.com/Archive")
;;                   (mu4e-trash-folder  . "/lucas@lucasgaldino.com/Trash")))))
;;   (setq mu4e-maildir-shortcuts
;;         '((:maildir "/jlng3@alu.ua.es/INBOX" :key ?u)
;;           (:maildir "/jlucasngaldino@gmail.com/INBOX" :key ?g)
;;           (:maildir "/lucasgaldino@disroot.org/INBOX" :key ?p)
;;           (:maildir "/lucas@lucasgaldino.com/INBOX" :key ?b))))

;; (after! yeetube
;;   ;; First ensure the keymap exists
;;   (defvar yeetube-mode-map (make-sparse-keymap))

;;   ;; Then use map! to bind keys to that specific keymap
;;   (map! :map yeetube-mode-map
;;         :n "c" #'yeetube-copy-url
;;         :n "p" #'yeetube-play
;;         :n "s" #'yeetube-search
;;         :n "D" #'yeetube-download-change-directory
;;         :n "d" #'yeetube-download-video))
;; (map! :leader
;;       :desc "Open yeetube" "e y" #'yeetube-search)

;; ;; Buku
;; (setq ebuku-buku-path "~/.local/bin/buku")

;; Ellama
;; (use-package! ellama
;;   :bind ("C-c e" . ellama-transient-main-menu)
;;   :init
;;   ;; setup key bindings
;;   ;; (setopt ellama-keymap-prefix "C-c e")
;;   ;; language you want ellama to translate to
;;   (setopt ellama-language "English")
;;   ;; could be llm-openai for example
;;   (require 'llm-ollama)
;;   (setopt ellama-provider
;;           (make-llm-ollama
;;            ;; this model should be pulled to use it
;;            ;; value should be the same as you print in terminal during pull
;;            :chat-model "llama3.2"
;;            :embedding-model "nomic-embed-text"
;;            :default-chat-non-standard-params '(("num_ctx" . 8192))))
;;   (setopt ellama-summarization-provider
;;           (make-llm-ollama
;;            :chat-model "llama3.2"
;;            :embedding-model "nomic-embed-text"
;;            :default-chat-non-standard-params '(("num_ctx" . 32768))))
;;   (setopt ellama-coding-provider
;;           (make-llm-ollama
;;            :chat-model "llama3.2"
;;            :embedding-model "nomic-embed-text"
;;            :default-chat-non-standard-params '(("num_ctx" . 32768))))
;;   ;; Predefined llm providers for interactive switching.
;;   ;; You shouldn't add ollama providers here - it can be selected interactively
;;   ;; without it. It is just example.
;;   (setopt ellama-providers
;;           '(("zephyr" . (make-llm-ollama
;;                          :chat-model "zephyr:7b-beta-q6_K"
;;                          :embedding-model "zephyr:7b-beta-q6_K")) ("mistral" . (make-llm-ollama
;;                           :chat-model "mistral:7b-instruct-v0.2-q6_K"
;;                           :embedding-model "mistral:7b-instruct-v0.2-q6_K"))
;;             ("mixtral" . (make-llm-ollama
;;                           :chat-model "mixtral:8x7b-instruct-v0.1-q3_K_M-4k"
;;                           :embedding-model "mixtral:8x7b-instruct-v0.1-q3_K_M-4k"))))
;;   ;; Naming new sessions with llm
;;   (setopt ellama-naming-provider
;;           (make-llm-ollama
;;            :chat-model "llama3.2"
;;            :embedding-model "nomic-embed-text"
;;            :default-chat-non-standard-params '(("stop" . ("\n")))))
;;   (setopt ellama-naming-scheme 'ellama-generate-name-by-llm)
;;   ;; Translation llm provider
;;   (setopt ellama-translation-provider
;;           (make-llm-ollama
;;            :chat-model "llama3.2"
;;            :embedding-model "nomic-embed-text"
;;            :default-chat-non-standard-params
;;            '(("num_ctx" . 32768))))
;;   ;; customize display buffer behaviour
;;   ;; see ~(info "(elisp) Buffer Display Action Functions")~
;;   (setopt ellama-chat-display-action-function #'display-buffer-full-frame)
;;   (setopt ellama-instant-display-action-function #'display-buffer-at-bottom)
;;   :config
;;   ;; send last message in chat buffer with C-c C-c
;;   (add-hook 'org-ctrl-c-ctrl-c-hook #'ellama-chat-send-last-message)
;;   (setq ellama-sessions-directory "~/org/assets/ellama-sessions/"
;;         ellama-sessions-auto-save t))

(use-package! ox-typst
  :after org)

(setq auto-mode-alist
      (append '((".*\\.epub\\'" . nov-mode))
              auto-mode-alist))

(define-derived-mode astro-mode web-mode "astro")
(setq auto-mode-alist
      (append '((".*\\.astro\\'" . astro-mode))
              auto-mode-alist))

(after! eglot
  (add-to-list 'eglot-server-programs
               '(typst-ts-mode . ("tinymist")))
  (add-to-list 'eglot-server-programs
               '(astro-mode . ("astro-ls" "--stdio"
                               :initializationOptions
                               (:typescript (:tsdk "./node_modules/typescript/lib"))))))


;; Install Janet Tree-sitter grammar at startup
(setq treesit-language-source-alist
      (append treesit-language-source-alist
              (if (eq 'windows-nt system-type)
                  '((janet-simple
                     . ("https://github.com/sogaiu/tree-sitter-janet-simple"
                        nil nil "gcc.exe")))
                '((janet-simple
                   . ("https://github.com/sogaiu/tree-sitter-janet-simple"))))))

;; Install the grammar if not available
(when (not (treesit-language-available-p 'janet-simple))
  (treesit-install-language-grammar 'janet-simple))

;; Configure janet-ts-mode
(use-package! janet-ts-mode
  :mode "\\.janet\\'")

(after! epa
  (setq epa-pinentry-mode 'loopback)
  (setq epa-file-cache-passphrase-for-symmetric-encryption nil))

;; Languagetool
(setq lsp-log-io t)
;; (use-package! languagetool
;;   :config
;;   (setq languagetool-java-arguments '("-Dfile.encoding=UTF-8")
;;         languagetool-console-command "~/.languagetool/LanguageTool-6.5/languagetool-commandline.jar"
;;         languagetool-server-command "~/.languagetool/LanguageTool-6.5/languagetool-server.jar"))

;; Sysman
(defun emacs-sysman ()
  "Run sysman from Emacs."
  (interactive)
  (let* ((script-path "sm")
         (options '("install"
                    "list unmanaged"
                    "--help"))
         (choice (completing-read "select an option: " options nil t)))
    (async-shell-command (concat (shell-quote-argument script-path) " " choice))))

(map! :leader
      :desc "Configure emacs" "e c e" (lambda () (interactive) (find-file "~/syma/doom-emacs.org")))

(map! :leader
      :desc "Configure system packages" "e c p" (lambda () (interactive) (find-file "~/system-manager/metapac.org")))

(map! :leader
      :desc "Open sm" "e x" #'emacs-sysman)

(map! :leader
      :desc "Open beancount ledger" "l" (lambda () (interactive) (find-file "~/Documents/30-39--Finances/34--ledgers/2025.beancount")))

(map! :leader
      :desc "Find file with consult" "e f f" #'consult-find)

(map! :leader
      :desc "Rg files with consult" "e f r" #'consult-ripgrep)

(map! :prefix "C-c m"
      :desc "Toggle play/pause" "SPC" #'libmpdel-playback-play-pause
      :desc "Next track"        "n"   #'libmpdel-playback-next
      :desc "Previous track"    "p"   #'libmpdel-playback-previous
      :desc "Stop"              "s"   #'libmpdel-stop
      :desc "Open playlist"     "l"   #'mpdel-playlist-open
      :desc "Browse library"    "b"   #'mpdel-browser-open
      :desc "Current song"      "v"   #'mpdel-song-open
      :desc "Volume up"         "+"   #'mpdel-core-volume-increase
      :desc "Volume down"       "-"   #'mpdel-core-volume-decrease
      :desc "Seek"      "f"   #'libmpdel-playback-seek
      :desc "Connect profile"   "C"   #'mpdel-core-connect-profile)



(use-package! mpdel
  :config
  (defun setup-mpdel-keybindings ()
    "Set up keybindings for mpdel buffers"
    ;; Navigation
    (local-set-key (kbd "n") 'next-line)
    (local-set-key (kbd "p") 'previous-line)
    (local-set-key (kbd "RET") 'mpdel-browser-open)
    (local-set-key (kbd "^") 'mpdel-browser-open-parent)
    (local-set-key (kbd "C-x C-j") 'mpdel-dired-open)

    ;; Playlist actions
    (local-set-key (kbd "a") 'mpdel-playlist-add)
    (local-set-key (kbd "A") 'mpdel-playlist-add-to-stored-playlist)
    (local-set-key (kbd "r") 'mpdel-playlist-replace)
    (local-set-key (kbd "R") 'mpdel-playlist-replace-stored-playlist)
    (local-set-key (kbd "P") 'mpdel-core-play)

    ;; Playback control (mirror global bindings)
    (local-set-key (kbd "SPC") 'mpdel-core-toggle-play-pause)
    (local-set-key (kbd "M-n") 'mpdel-core-next)
    (local-set-key (kbd "M-p") 'mpdel-core-previous)
    (local-set-key (kbd "s") 'mpdel-core-stop)

    ;; Volume
    (local-set-key (kbd "+") 'mpdel-core-volume-increase)
    (local-set-key (kbd "-") 'mpdel-core-volume-decrease)

    ;; View/info
    (local-set-key (kbd "v") 'mpdel-song-open)
    (local-set-key (kbd "C") 'mpdel-core-connect-profile))

  ;; Apply keybindings to all relevant mpdel modes
  (add-hook 'mpdel-playlist-mode-hook #'setup-mpdel-keybindings)
  (add-hook 'mpdel-browser-mode-hook #'setup-mpdel-keybindings)
  (add-hook 'mpdel-song-mode-hook #'setup-mpdel-keybindings)
  (add-hook 'mpdel-tablist-mode-hook #'setup-mpdel-keybindings))

;; Yewtube
(defun yewtube()
  "Run Yewtube from Emacs."
  (async-shell-command "~/.local/bin/yt"))

(setq shell-file-name (executable-find fish))
(setq explicit-shell-file-name shell-file-name)
(use-package! exec-path-from-shell
  :init
  (when (memq window-system '(mac ns x))
    (exec-path-from-shell-initialize)
    (exec-path-from-shell-copy-envs '("PATH" "SHELL"))))

(setq eshell-aliases-file (expand-file-name "eshell/aliases" doom-user-dir))

(setq org-contacts-files '("~/org/agenda/address-book.org"))

(setq diary-file "~/org/agenda/diary")
(setq diary-date-forms diary-iso-date-forms)

;; EMPV
(setq empv-invidious-instance "https://invidious.f5.si/api/v1")
(map! :map empv-youtube-results-mode-map
      :n [return] #'empv-youtube-results-play-current
      :n "RET"    #'empv-youtube-results-play-current)

;; Nice look
(with-eval-after-load 'org (global-org-modern-mode))

;; Center things
(defun org-agenda-open-hook ()
  (olivetti-mode))
(add-hook 'org-agenda-mode-hook 'org-agenda-open-hook)
(setq olivetti-body-width 120)

;; wttrin
(setq wttrin-default-cities '("Alicante" "Spain"))

;; Jinx
(use-package! jinx
  :hook (after-init . global-jinx-mode))

;; Anki editor
(use-package! anki-editor)

(setq truncate-lines nil)

(defun my/clean-downloads ()
  "Run the Fish `clean-downloads` script natively from Emacs."
  (interactive)
  (shell-command "clean-downloads.fish"))

(defun my/anki-renumber-clozes-under-heading ()
  "Renumber all {{cN::...}} clozes sequentially within the current Org subtree."
  (interactive)
  (unless (derived-mode-p 'org-mode)
    (user-error "This command only works in org-mode buffers"))
  (save-excursion
    ;; Narrow to the current heading
    (org-back-to-heading t)
    (org-narrow-to-subtree)
    (goto-char (point-min))
    (let ((counter 1)
          (regexp "{{c[0-9]+::"))
      (while (re-search-forward regexp nil t)
        (replace-match (format "{{c%d::" counter) nil nil)
        (setq counter (1+ counter))))
    (widen)
    (message "Renumbered %d clozes under heading: %s"
             (1- counter)
             (nth 4 (org-heading-components)))))



;; The exceptions to this rule:
;;
;;   - Setting file/directory variables (like `org-directory')
;;   - Setting variables which explicitly tell you to set them before their
;;     package is loaded (see 'C-h v VARIABLE' to look up their documentation).
;;   - Setting doom variables (which start with 'doom-' or '+').
;;
;; Here are some additional functions/macros that will help you configure Doom.
;;
;; - `load!' for loading external *.el files relative to this one
;; - `use-package!' for configuring packages
;; - `after!' for running code after a package has loaded
;; - `add-load-path!' for adding directories to the `load-path', relative to
;;   this file. Emacs searches the `load-path' when you load packages with
;;   `require' or `use-package'.
;; - `map!' for binding new keys
;;
;; To get information about any of these functions/macros, move the cursor over
;; the highlighted symbol at press 'K' (non-evil users must press 'C-c c k').
;; This will open documentation for it, including demos of how they are used.
;; Alternatively, use `C-h o' to look up a symbol (functions, variables, faces,
;; etc).
;;
;; You can also try 'gd' (or 'C-c c d') to jump to their definition and see how
;; they are implemented.
;; Rest:1 ends here
